Revit 2026 API

# SolidSolidCutUtilsIsAllowedForSolidCut Method

---

Validates that the element is eligible for a solid-solid cut.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsAllowedForSolidCut(
	Element element
)
```
```vb
Public Shared Function IsAllowedForSolidCut (
	element As Element
) As Boolean
```
```cpp
public:
static bool IsAllowedForSolidCut(
	Element^ element
)
```
```fsharp
static member IsAllowedForSolidCut :
        element : Element -> bool
```

#### Parameters

element Element
     The solid to be cut or the cutting solid.

#### Return Value

Boolean True if the input element can participate in a solid-solid cut. False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The element must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.

#### Reference

SolidSolidCutUtils Class

Autodesk.Revit.DB Namespace